```


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.atk-demo-develop.kubernetes_namespace.apps will be created
  + resource "kubernetes_namespace" "apps" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "atk-demo-develop"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.atk-demo-develop.kubernetes_secret.app-dns will be created
  + resource "kubernetes_secret" "app-dns" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "db-connection"
          + namespace        = "atk-demo-develop"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.atk-demo-develop.mysql_database.atk-demo will be created
  + resource "mysql_database" "atk-demo" {
      + default_character_set = "utf8"
      + default_collation     = "utf8_general_ci"
      + id                    = (known after apply)
      + name                  = "atk-demo-develop"
    }

  # module.atk-demo-develop.mysql_grant.atk-demo["admin"] will be created
  + resource "mysql_grant" "atk-demo" {
      + database   = "atk-demo-develop"
      + grant      = false
      + host       = "%"
      + id         = (known after apply)
      + privileges = [
          + "all privileges",
        ]
      + table      = "*"
      + tls_option = "NONE"
      + user       = "atk-demo-develop-admin"
    }

  # module.atk-demo-develop.mysql_grant.atk-demo["ro"] will be created
  + resource "mysql_grant" "atk-demo" {
      + database   = "atk-demo-develop"
      + grant      = false
      + host       = "%"
      + id         = (known after apply)
      + privileges = [
          + "select",
        ]
      + table      = "*"
      + tls_option = "NONE"
      + user       = "atk-demo-develop-ro"
    }

  # module.atk-demo-develop.mysql_user.atk-demo["admin"] will be created
  + resource "mysql_user" "atk-demo" {
      + host               = "%"
      + id                 = (known after apply)
      + plaintext_password = (sensitive value)
      + tls_option         = "NONE"
      + user               = "atk-demo-develop-admin"
    }

  # module.atk-demo-develop.mysql_user.atk-demo["ro"] will be created
  + resource "mysql_user" "atk-demo" {
      + host               = "%"
      + id                 = (known after apply)
      + plaintext_password = (sensitive value)
      + tls_option         = "NONE"
      + user               = "atk-demo-develop-ro"
    }

  # module.atk-demo-develop.random_password.atk-demo["admin"] will be created
  + resource "random_password" "atk-demo" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.atk-demo-develop.random_password.atk-demo["ro"] will be created
  + resource "random_password" "atk-demo" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      +
```